Problem 1: Groupby Aggregation

Find the total Marks for each Gender.

Calculate the average Age for each City.

Problem 2: Multi-Aggregation

For each City, calculate both:

The maximum Marks.

The minimum Age.

Problem 3: Handling Dates

Create a new column, JoinDate, with random dates between January 1, 2023, and December 31, 2023.

Group by JoinDate (month-wise) and find the total Marks for students who joined in the same month.

Hint: Use pd.to_datetime() and dt.month.

Problem 4: Combining Conditions with Groupby

Find the average Marks for Male students from "Chicago" or "New York."


Bonus:

Using groupby(), determine:

The number of students grouped by both Gender and City.

Write a custom function to calculate:

The performance category ("High", "Medium", "Low") based on Marks for each group.

Assign it to a new column called PerformanceCategory.

In [1]:
import pandas as pd

In [2]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [3]:
vr.groupby("Gender")["Marks"].sum()

Gender
Female    181
Male      163
Name: Marks, dtype: int64

In [4]:
vr.groupby("City")["Age"].mean()

City
Chicago         12.0
Los Angeles     22.0
New York        20.0
San Fransico    21.0
Name: Age, dtype: float64

In [5]:
c=vr.groupby("City").agg(Maxmarks=("Marks","max"),minAge=("Age","min")) #multiagg
c

              Maxmarks  minAge
City
Chicago             75      12
Los Angeles         92      22
New York            88      20
San Fransico        89      21

In [6]:
import pandas as pd
import numpy as np

# Generate random dates
np.random.seed(42)
random_dates = pd.to_datetime(np.random.choice(pd.date_range("2023-01-01", "2023-12-31"), len(vr)))
vr["JoinDate"] = random_dates
print(vr)

    Name  Age  Gender  Marks          City   JoinDate
0   John   20    Male     88      New York 2023-04-13
1  Alice   22  Female     92   Los Angeles 2023-12-15
2    Bob   12    Male     75       Chicago 2023-09-28
3   Emma   21  Female     89  San Fransico 2023-04-17

In [7]:
# Add a column for months
vr["JoinMonth"] = vr["JoinDate"].dt.month

# Group by month and calculate total Marks
marks_by_month = vr.groupby("JoinMonth")["Marks"].sum()
print(marks_by_month)

JoinMonth
4     177
9      75
12     92
Name: Marks, dtype: int64

In [8]:
s=vr.loc[(vr["Gender"]=="Male")&(vr["City"].isin(["Chicago","New York"]))].groupby("City")["Marks"].mean()
s

City
Chicago     75.0
New York    88.0
Name: Marks, dtype: float64

In [9]:
def per(Marks):
    if Marks>90:
        return "High"
    elif Marks>80:
        return "Meduim"
    else:
        return "Low"
vr["PerformanceCategory"]=vr["Marks"].apply(per)
vr

,Name,Age,Gender,Marks,City,JoinDate,JoinMonth,PerformanceCategory
0,John,20,Male,88,New York,2023-04-13,4,Meduim
1,Alice,22,Female,92,Los Angeles,2023-12-15,12,High
2,Bob,12,Male,75,Chicago,2023-09-28,9,Low
3,Emma,21,Female,89,San Fransico,2023-04-17,4,Meduim

In [10]:
vr.groupby(["Gender","City"]).size()

Gender  City
Female  Los Angeles     1
        San Fransico    1
Male    Chicago         1
        New York        1
dtype: int64